<%--
  Created by IntelliJ IDEA.
  User: zhang.peng03
  Date: 2018/11/26
  Time: 14:47
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>填空题</title>
</head>
<body>
<p>
    ######格式说明：（文件需要以UTF-8格式编码，推荐notepad++编辑和转换编码）<br/>
    ######每道题第一行应至少以6个#号开头（"######"），<br/>
    ######第二行用3个*号开头("***")表示该题所属章节或知识点<br/>
    ######第三行开始用数字开头（数字表示题号，是多少无所谓）表示填空题题干描述，可以为多行<br/>
    ######题干中用下划线表示填空的位置。<br/>

    ###### 注意，题干的第二行开始开头不能再用字母或数字（因已经被题干的首字符占用）<br/>
    ######题干结束后的一行，以三个>号开头（">>>"）表示答案，多个答案用空格分割；<br/>

    #######在有可能引起歧义的情况下（例如答案中本身含有逗号），题干可采用第二种形式，<br/>
    #######即在题干中包含答案，答案用<<<和>>>包围，此时不应有专门的答案行。<br/>
    ######所有题结束后最后一行应至少以6个#号开头（"######"），后续不能有空行！<br/>

    ######<br/>
    ***异常处理***<br/>
    1．	对于程序中某个方法中可能出现的受检查异常(Checked Exception)，<br/>
    要么用try…catch语句捕获并处理它，要么用______________关键字声明抛出该异常。<br/>
    >>>throws<br/>
    ######<br/>
    ***Java语言基础***<br/>
    2．	由于Java基本类型中的double或float在计算高精度时会产生损失，<br/>
    应选用______________类来进行高精度数学计算。<br/>
    >>>BigDecimal<br/>
    ######<br/>
    ***多线程***<br/>
    3, Thread类的______________方法可以设定线程的优先级，优先级的值越_______，表示优先级别越高。<br/>
    >>>setPriority(),高<br/>
    ######<br/>
</p>

</body>
</html>
